src/Catalogs/КонтрагентМесто/КонтрагентМесто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтрагентМесто</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Район</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>УлицаДом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Улица</name>
    <type>
      <types>CatalogRef.Улица</types>
    </type>
  </attributes>
  <attributes>
    <name>Дом</name>
    <type>
      <types>CatalogRef.Дом</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/КонтрагентМесто/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	ПодстановкаУлицаДом();
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	ПодстановкаУлицаДом();
КонецПроцедуры

Процедура ПодстановкаУлицаДом() 
	Если ЗначениеЗаполнено(Объект.Дом) Тогда
		Объект.УлицаДом = "" + Объект.Улица + ", " + Объект.Дом;
	Иначе
		Объект.УлицаДом = "" + Объект.Улица;
	КонецЕсли;  
КонецПроцедуры
